# IFC_SetIFCEntity

## Description
Sets IFC entity type

```pascal
FUNCTION IFC_SetIFCEntity(
				hObject      : HANDLE;
				inStrIfcName : STRING) : BOOLEAN;
```

```python

def vs.IFC_SetIFCEntity(hObject, inStrIfcName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrIfcName|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* IFC